index.org
#+title:  Luiz Alberto do Carmo Viana
#+author: Luiz Alberto do Carmo Viana

#+setupfile: org-html-themes/setup/theme-bigblow-local.setup

Professor and researcher at Federal University of Ceará, Crateús
Campus. I am lecturing mainly in the Computer Science Graduation
Course.

You can view my Lattes curriculum at http://lattes.cnpq.br/2028165237751191

You can visit this site's repository [[https://github.com/luizalbertocviana/luizalbertocviana.github.io][here]].

* Contact
  - Personal email: [[mailto:luizalbertocviana@gmail.com][luizalbertocviana@gmail.com]]
  - Professional email: [[mailto:luizalberto@crateus.ufc.br][luizalberto@crateus.ufc.br]]
  - Github: https://github.com/luizalbertocviana
  - LinkedIn: https://www.linkedin.com/in/luiz-alberto-430b5239
* Articles
** 2017
  - *CSBC* The Least-Dependency Constrained Spanning Tree Problem
    ([[manoel]]) [[http://csbc2017.mackenzie.br/public/files/all/anais-csbc-2017.pdf][link]]
  - *SBPO* Two Dependency Constrained Spanning Tree Problems ([[manoel]])
    [[http://www.sbpo2017.iltc.br/pdf/168962.pdf][link]]
** 2019
  - *SBPO* (Portuguese) Um Algoritmo Exato para o Problema da Biclique Induzida
    Balanceada Máxima com Partições em Cliques e Bonecas Russas
    ([[marcus]], [[rennan]]) [[https://proceedings.science/proceedings/100090/_papers/106757/download/abstract_file2?lang=pt-br][link]]
  - *SBPO* (Portuguese) Uma Abordagem Híbrida Exata-Heurística Aplicada ao Problema
    do Ciclo Mediano sem Restrições de Capacidade ([[paulo]], [[lisieux]])
    [[https://proceedings.science/proceedings/100090/_papers/106758/download/abstract_file2?lang=pt-br][link]]
  - *ENTCS* The Generalized Dependency Constrained Spanning Tree
    Problem ([[manoel]]) [[https://reader.elsevier.com/reader/sd/pii/S1571066119301136?token=5C49470DC0048D2D2C2B3AD4828CCBA66C7AE52E3FEA38F89E30BA45D83DFBCDCF87FE5A8D40B9439009536BC62A65D4][link]]
** 2020
   - *ITOR* Two Dependency Constrained Spanning Tree Problems ([[manoel]])
     [[https://onlinelibrary.wiley.com/doi/abs/10.1111/itor.12690][link]]
** 2021
   - *JOCO* A unifying model for locally constrained spanning tree
     problems ([[manoel]], [[ignasi]], [[shirley]]) [[https://link.springer.com/article/10.1007/s10878-021-00740-2][link]]
* Other Works
** Extended Abstracts and Posters
   - *SBPO 2019* (Portuguese) Um Modelo de Programação Inteira Aplicado ao Problema
     de Alocação de Salas da Universidade Federal do Ceará - Campus
     Crateús ([[bruno]], [[lisieux]]) [[https://proceedings.science/proceedings/100090/_papers/106943/download/abstract_file2?lang=pt-br][link]]
** Repositories
   - [[https://github.com/luizalbertocviana/cracking-coding-problems][cracking-coding-problems]] contains C++ solutions to the problems
     presented in the Cracking the Coding Interview book.
   - [[https://github.com/luizalbertocviana/data-structures-cpp][data-structures-cpp]] is a collection of classic data structures
     implemented in C++ for didatic purposes.
   - [[https://github.com/luizalbertocviana/dotfiles][dotfiles]] contais my work environment setup. Highlight for Emacs,
     vim and i3wm setup.
   - [[https://github.com/luizalbertocviana/lisp-experiments][lisp-experiments]] is a collection of Common Lisp source code I
     have written to learn the language.
** Slides
   - A talk on modern C++: [[file:slides/cpp.pdf][pdf]] [[file:slides/cpp.tex][tex]]
* Undergraduate Tutoring
  - Bruno Teixeira de Sousa ([[lisieux]]) [[http://repositorio.ufc.br/handle/riufc/48318][link]]
  - João Paulo de Araújo ([[rennan]]) [[http://repositorio.ufc.br/handle/riufc/43969][link]]
  - Marcus Vinícius Martins Melo ([[rennan]]) [[http://repositorio.ufc.br/handle/riufc/43970][link]]
  - Paulo Henrique Sousa de Araújo ([[lisieux]]) [[http://repositorio.ufc.br/handle/riufc/49078][link]]
* Collaborators
** Professors
  1. <<shirley>> Ana Shirley Ferreira da Silva [[http://lattes.cnpq.br/2132614695901416][lattes]]
  2. <<ignasi>> Ignasi Sau [[http://orcid.org/0000-0002-8981-9287][orcid]]
  3. <<lisieux>> Lisieux Marie Marinho dos Santos Andrade [[http://lattes.cnpq.br/8824525263721786][Lattes]]
  4. <<manoel>> Manoel Bezerra Campêlo Neto [[http://lattes.cnpq.br/7207626266770213][Lattes]]
  5. <<rennan>> Rennan Ferreira Dantas [[http://lattes.cnpq.br/0192579272041443][Lattes]]
** Students
  1. <<bruno>> Bruno Teixeira de Sousa [[http://lattes.cnpq.br/5987909872617550][Lattes]]
  2. <<alex>> Francisco Alex Sousa Anchieta [[http://lattes.cnpq.br/2903943249633436][Lattes]]
  3. <<marcus>> Marcus Vinícius Martins Melo [[http://lattes.cnpq.br/6091624045920112][Lattes]]
  4. <<paulo>> Paulo Henrique Sousa de Araújo [[http://lattes.cnpq.br/6182698151198285][Lattes]]
* Undergraduate Disciplines
** Linear Algebra
   - semester: 2018.2
   - video playlist (in Portuguese) on Abstract Algebra at [[https://www.youtube.com/playlist?list=PLRDuHd2Ia_bslqqkwYQHqRx_cPu4dfDaX][youtube]]
** Data Structures
   - semester: 2016.2, 2018.2
   - lecture notes (in Portuguese) kindly provided by [[alex]]: [[file:ed/document.pdf][pdf]]
   - video playlist (in Portuguese) at [[https://www.youtube.com/playlist?list=PLRDuHd2Ia_btEpfhW7T9Sw-H2g3rihi-I][youtube]]
** Advanced Data Structures
   - semester: 2020.1
   - lecture notes (in Portuguese): [[https://github.com/luiz-classrooms/eda-lecture-notes][repsitory]]
   - video playlist (in Portuguese) at [[https://www.youtube.com/playlist?list=PLRDuHd2Ia_btEpfhW7T9Sw-H2g3rihi-I][youtube]]
** Automata and Formal Languages
   - semester: 2018.2, 2019.2
** Introduction to Discrete Mathematics
   - semester: 2017.2
** Computational Mathematics
   - semester: 2017.1, 2018.1, 2019.1, 2020.1
   - lecture notes (in Portuguese): [[https://github.com/luiz-classrooms/mc-lecture-notes][repository]]
   - video playlist (in Portuguese) at [[https://www.youtube.com/playlist?list=PLRDuHd2Ia_bu6YaDX-AwqmGmr9BhVx_Zr][youtube]]
** Discrete Mathematics
   - semester: 2016.2
** Functional Programming
   - semester: 2017.1, 2018.1, 2019.1, 2020.2
   - lecture notes (in Portuguese): [[https://github.com/luiz-classrooms/pf-lecture-notes][repository]]
   - video playlist (in Portuguese) at [[https://www.youtube.com/playlist?list=PLRDuHd2Ia_bt2iFyeOYttbswIwbQNbMSM][youtube]]
** Algorithm Design and Analysis
   - semester: 2019.2, 2020.2
   - video playlist (in Portuguese) at [[https://www.youtube.com/playlist?list=PLRDuHd2Ia_buAXDjLZl32FpSbsVZJ8OZH][youtube]]
   - video playlist (in Portuguese) of some sorting algorithms
     implemented in C++ at [[https://www.youtube.com/playlist?list=PLRDuHd2Ia_btDoim_kxpenbusvTbxZ9ub][youtube]]
** Theory of Computation
   - semester: 2017.2, 2018.2
