index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-20 ter 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Luiz Alberto do Carmo Viana</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Luiz Alberto do Carmo Viana" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Luiz Alberto do Carmo Viana</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org32dfa49">1. Contact</a></li>
<li><a href="#org3bae784">2. Articles</a>
<ul>
<li><a href="#org8a99c65">2.1. 2017</a></li>
<li><a href="#org07c97e1">2.2. 2019</a></li>
<li><a href="#org975eb65">2.3. 2020</a></li>
<li><a href="#orgd7aa41b">2.4. 2021</a></li>
</ul>
</li>
<li><a href="#orgdafb21d">3. Other Works</a>
<ul>
<li><a href="#org4a70c0b">3.1. Extended Abstracts and Posters</a></li>
<li><a href="#org5c50687">3.2. Repositories</a></li>
<li><a href="#orgcecdb95">3.3. Slides</a></li>
</ul>
</li>
<li><a href="#org52d47ee">4. Undergraduate Tutoring</a></li>
<li><a href="#orgba07f59">5. Collaborators</a>
<ul>
<li><a href="#org6b0008c">5.1. Professors</a></li>
<li><a href="#org844ff8e">5.2. Students</a></li>
</ul>
</li>
<li><a href="#org0cba916">6. Undergraduate Disciplines</a>
<ul>
<li><a href="#orgae323e5">6.1. Linear Algebra</a></li>
<li><a href="#org1ff92fc">6.2. Data Structures</a></li>
<li><a href="#org401cb5f">6.3. Advanced Data Structures</a></li>
<li><a href="#org2d494a8">6.4. Automata and Formal Languages</a></li>
<li><a href="#org06a5538">6.5. Introduction to Discrete Mathematics</a></li>
<li><a href="#orgf165401">6.6. Computational Mathematics</a></li>
<li><a href="#org6949acd">6.7. Discrete Mathematics</a></li>
<li><a href="#org7ffbcc1">6.8. Functional Programming</a></li>
<li><a href="#org9517bdb">6.9. Algorithm Design and Analysis</a></li>
<li><a href="#orgfd13b79">6.10. Theory of Computation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Professor and researcher at Federal University of Ceará, Crateús
Campus. I am lecturing mainly in the Computer Science Graduation
Course.
</p>

<p>
You can view my Lattes curriculum at <a href="http://lattes.cnpq.br/2028165237751191">http://lattes.cnpq.br/2028165237751191</a>
</p>

<p>
You can visit this site's repository <a href="https://github.com/luizalbertocviana/luizalbertocviana.github.io">here</a>.
</p>

<div id="outline-container-org32dfa49" class="outline-2">
<h2 id="org32dfa49"><span class="section-number-2">1</span> Contact</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Personal email: <a href="mailto:luizalbertocviana@gmail.com">luizalbertocviana@gmail.com</a></li>
<li>Professional email: <a href="mailto:luizalberto@crateus.ufc.br">luizalberto@crateus.ufc.br</a></li>
<li>Github: <a href="https://github.com/luizalbertocviana">https://github.com/luizalbertocviana</a></li>
<li>LinkedIn: <a href="https://www.linkedin.com/in/luiz-alberto-430b5239">https://www.linkedin.com/in/luiz-alberto-430b5239</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3bae784" class="outline-2">
<h2 id="org3bae784"><span class="section-number-2">2</span> Articles</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8a99c65" class="outline-3">
<h3 id="org8a99c65"><span class="section-number-3">2.1</span> 2017</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><b>CSBC</b> The Least-Dependency Constrained Spanning Tree Problem
(<a href="#org0436c10">4</a>) <a href="http://csbc2017.mackenzie.br/public/files/all/anais-csbc-2017.pdf">link</a></li>
<li><b>SBPO</b> Two Dependency Constrained Spanning Tree Problems (<a href="#org0436c10">4</a>)
<a href="http://www.sbpo2017.iltc.br/pdf/168962.pdf">link</a></li>
</ul>
</div>
</div>
<div id="outline-container-org07c97e1" class="outline-3">
<h3 id="org07c97e1"><span class="section-number-3">2.2</span> 2019</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><b>SBPO</b> (Portuguese) Um Algoritmo Exato para o Problema da Biclique Induzida
Balanceada Máxima com Partições em Cliques e Bonecas Russas
(<a href="#org82f840a">3</a>, <a href="#org99f4acf">5</a>) <a href="https://proceedings.science/proceedings/100090/_papers/106757/download/abstract_file2?lang=pt-br">link</a></li>
<li><b>SBPO</b> (Portuguese) Uma Abordagem Híbrida Exata-Heurística Aplicada ao Problema
do Ciclo Mediano sem Restrições de Capacidade (<a href="#org7c5fb26">4</a>, <a href="#org53c8e80">3</a>)
<a href="https://proceedings.science/proceedings/100090/_papers/106758/download/abstract_file2?lang=pt-br">link</a></li>
<li><b>ENTCS</b> The Generalized Dependency Constrained Spanning Tree
Problem (<a href="#org0436c10">4</a>) <a href="https://reader.elsevier.com/reader/sd/pii/S1571066119301136?token=5C49470DC0048D2D2C2B3AD4828CCBA66C7AE52E3FEA38F89E30BA45D83DFBCDCF87FE5A8D40B9439009536BC62A65D4">link</a></li>
</ul>
</div>
</div>
<div id="outline-container-org975eb65" class="outline-3">
<h3 id="org975eb65"><span class="section-number-3">2.3</span> 2020</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><b>ITOR</b> Two Dependency Constrained Spanning Tree Problems (<a href="#org0436c10">4</a>)
<a href="https://onlinelibrary.wiley.com/doi/abs/10.1111/itor.12690">link</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd7aa41b" class="outline-3">
<h3 id="orgd7aa41b"><span class="section-number-3">2.4</span> 2021</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><b>JOCO</b> A unifying model for locally constrained spanning tree
problems (<a href="#org0436c10">4</a>, <a href="#orgd425fa4">2</a>, <a href="#orgc0697be">1</a>) <a href="https://link.springer.com/article/10.1007/s10878-021-00740-2">link</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdafb21d" class="outline-2">
<h2 id="orgdafb21d"><span class="section-number-2">3</span> Other Works</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4a70c0b" class="outline-3">
<h3 id="org4a70c0b"><span class="section-number-3">3.1</span> Extended Abstracts and Posters</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><b>SBPO 2019</b> (Portuguese) Um Modelo de Programação Inteira Aplicado ao Problema
de Alocação de Salas da Universidade Federal do Ceará - Campus
Crateús (<a href="#org93c94fe">1</a>, <a href="#org53c8e80">3</a>) <a href="https://proceedings.science/proceedings/100090/_papers/106943/download/abstract_file2?lang=pt-br">link</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5c50687" class="outline-3">
<h3 id="org5c50687"><span class="section-number-3">3.2</span> Repositories</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://github.com/luizalbertocviana/cracking-coding-problems">cracking-coding-problems</a> contains C++ solutions to the problems
presented in the Cracking the Coding Interview book.</li>
<li><a href="https://github.com/luizalbertocviana/data-structures-cpp">data-structures-cpp</a> is a collection of classic data structures
implemented in C++ for didatic purposes.</li>
<li><a href="https://github.com/luizalbertocviana/dotfiles">dotfiles</a> contais my work environment setup. Highlight for Emacs,
vim and i3wm setup.</li>
<li><a href="https://github.com/luizalbertocviana/lisp-experiments">lisp-experiments</a> is a collection of Common Lisp source code I
have written to learn the language.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcecdb95" class="outline-3">
<h3 id="orgcecdb95"><span class="section-number-3">3.3</span> Slides</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>A talk on modern C++: <a href="slides/cpp.pdf">pdf</a> <a href="slides/cpp.tex">tex</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org52d47ee" class="outline-2">
<h2 id="org52d47ee"><span class="section-number-2">4</span> Undergraduate Tutoring</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Bruno Teixeira de Sousa (<a href="#org53c8e80">3</a>) <a href="http://repositorio.ufc.br/handle/riufc/48318">link</a></li>
<li>João Paulo de Araújo (<a href="#org99f4acf">5</a>) <a href="http://repositorio.ufc.br/handle/riufc/43969">link</a></li>
<li>Marcus Vinícius Martins Melo (<a href="#org99f4acf">5</a>) <a href="http://repositorio.ufc.br/handle/riufc/43970">link</a></li>
<li>Paulo Henrique Sousa de Araújo (<a href="#org53c8e80">3</a>) <a href="http://repositorio.ufc.br/handle/riufc/49078">link</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgba07f59" class="outline-2">
<h2 id="orgba07f59"><span class="section-number-2">5</span> Collaborators</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6b0008c" class="outline-3">
<h3 id="org6b0008c"><span class="section-number-3">5.1</span> Professors</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li><a id="orgc0697be"></a> Ana Shirley Ferreira da Silva <a href="http://lattes.cnpq.br/2132614695901416">Lattes</a></li>
<li><a id="orgd425fa4"></a> Ignasi Sau <a href="http://orcid.org/0000-0002-8981-9287">Orcid</a></li>
<li><a id="org53c8e80"></a> Lisieux Marie Marinho dos Santos Andrade <a href="http://lattes.cnpq.br/8824525263721786">Lattes</a></li>
<li><a id="org0436c10"></a> Manoel Bezerra Campêlo Neto <a href="http://lattes.cnpq.br/7207626266770213">Lattes</a></li>
<li><a id="org99f4acf"></a> Rennan Ferreira Dantas <a href="http://lattes.cnpq.br/0192579272041443">Lattes</a></li>
</ol>
</div>
</div>
<div id="outline-container-org844ff8e" class="outline-3">
<h3 id="org844ff8e"><span class="section-number-3">5.2</span> Students</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li><a id="org93c94fe"></a> Bruno Teixeira de Sousa <a href="http://lattes.cnpq.br/5987909872617550">Lattes</a></li>
<li><a id="org00470de"></a> Francisco Alex Sousa Anchieta <a href="http://lattes.cnpq.br/2903943249633436">Lattes</a></li>
<li><a id="org82f840a"></a> Marcus Vinícius Martins Melo <a href="http://lattes.cnpq.br/6091624045920112">Lattes</a></li>
<li><a id="org7c5fb26"></a> Paulo Henrique Sousa de Araújo <a href="http://lattes.cnpq.br/6182698151198285">Lattes</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org0cba916" class="outline-2">
<h2 id="org0cba916"><span class="section-number-2">6</span> Undergraduate Disciplines</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgae323e5" class="outline-3">
<h3 id="orgae323e5"><span class="section-number-3">6.1</span> Linear Algebra</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>semester: 2018.2</li>
<li>video playlist (in Portuguese) on Abstract Algebra at <a href="https://www.youtube.com/playlist?list=PLRDuHd2Ia_bslqqkwYQHqRx_cPu4dfDaX">youtube</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1ff92fc" class="outline-3">
<h3 id="org1ff92fc"><span class="section-number-3">6.2</span> Data Structures</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>semester: 2016.2, 2018.2</li>
<li>lecture notes (in Portuguese) kindly provided by <a href="#org00470de">2</a>: <a href="ed/document.pdf">pdf</a></li>
<li>video playlist (in Portuguese) at <a href="https://www.youtube.com/playlist?list=PLRDuHd2Ia_btEpfhW7T9Sw-H2g3rihi-I">youtube</a></li>
</ul>
</div>
</div>
<div id="outline-container-org401cb5f" class="outline-3">
<h3 id="org401cb5f"><span class="section-number-3">6.3</span> Advanced Data Structures</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>semester: 2020.1</li>
<li>lecture notes (in Portuguese): <a href="https://github.com/luiz-classrooms/eda-lecture-notes">repsitory</a></li>
<li>video playlist (in Portuguese) at <a href="https://www.youtube.com/playlist?list=PLRDuHd2Ia_btEpfhW7T9Sw-H2g3rihi-I">youtube</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2d494a8" class="outline-3">
<h3 id="org2d494a8"><span class="section-number-3">6.4</span> Automata and Formal Languages</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>semester: 2018.2, 2019.2</li>
</ul>
</div>
</div>
<div id="outline-container-org06a5538" class="outline-3">
<h3 id="org06a5538"><span class="section-number-3">6.5</span> Introduction to Discrete Mathematics</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li>semester: 2017.2</li>
</ul>
</div>
</div>
<div id="outline-container-orgf165401" class="outline-3">
<h3 id="orgf165401"><span class="section-number-3">6.6</span> Computational Mathematics</h3>
<div class="outline-text-3" id="text-6-6">
<ul class="org-ul">
<li>semester: 2017.1, 2018.1, 2019.1, 2020.1</li>
<li>lecture notes (in Portuguese): <a href="https://github.com/luiz-classrooms/mc-lecture-notes">repository</a></li>
<li>video playlist (in Portuguese) at <a href="https://www.youtube.com/playlist?list=PLRDuHd2Ia_bu6YaDX-AwqmGmr9BhVx_Zr">youtube</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6949acd" class="outline-3">
<h3 id="org6949acd"><span class="section-number-3">6.7</span> Discrete Mathematics</h3>
<div class="outline-text-3" id="text-6-7">
<ul class="org-ul">
<li>semester: 2016.2</li>
</ul>
</div>
</div>
<div id="outline-container-org7ffbcc1" class="outline-3">
<h3 id="org7ffbcc1"><span class="section-number-3">6.8</span> Functional Programming</h3>
<div class="outline-text-3" id="text-6-8">
<ul class="org-ul">
<li>semester: 2017.1, 2018.1, 2019.1, 2020.2</li>
<li>lecture notes (in Portuguese): <a href="https://github.com/luiz-classrooms/pf-lecture-notes">repository</a></li>
<li>video playlist (in Portuguese) at <a href="https://www.youtube.com/playlist?list=PLRDuHd2Ia_bt2iFyeOYttbswIwbQNbMSM">youtube</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9517bdb" class="outline-3">
<h3 id="org9517bdb"><span class="section-number-3">6.9</span> Algorithm Design and Analysis</h3>
<div class="outline-text-3" id="text-6-9">
<ul class="org-ul">
<li>semester: 2019.2, 2020.2</li>
<li>video playlist (in Portuguese) at <a href="https://www.youtube.com/playlist?list=PLRDuHd2Ia_buAXDjLZl32FpSbsVZJ8OZH">youtube</a></li>
<li>video playlist (in Portuguese) of some sorting algorithms
implemented in C++ at <a href="https://www.youtube.com/playlist?list=PLRDuHd2Ia_btDoim_kxpenbusvTbxZ9ub">youtube</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfd13b79" class="outline-3">
<h3 id="orgfd13b79"><span class="section-number-3">6.10</span> Theory of Computation</h3>
<div class="outline-text-3" id="text-6-10">
<ul class="org-ul">
<li>semester: 2017.2, 2018.2</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luiz Alberto do Carmo Viana</p>
<p class="date">Created: 2021-04-20 ter 16:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
